src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/РеализацияТоваровУслуг/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("PDV") Тогда 
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоХранения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = РегистрыСведений.НастройкиПользователей.СкладПользователя();
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;   
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры

#Область Обработчики_событий_формы

&НаКлиенте
Процедура ФильтрОперацииПриИзменении(Элемент)

	ПрименитьФильтрОперации();

КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ПрименитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// Отложенно: при листании стрелками не дёргать сервер на каждую строку.
	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведения", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведения()

	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСведения(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд_формы

// Создаёт реализации по выделенным заказам закладки «Заказы к отгрузке».
// Один заказ - открывается форма нового документа; несколько - документы создаются
// и записываются без проведения, чтобы кладовщик проверил и провёл каждый сам.
//
// Параметры:
//  Команда - КомандаФормы - выполняемая команда
//
&НаКлиенте
Процедура ОформитьРеализацию(Команда)

	Заказы = Элементы.СписокЗаказы.ВыделенныеСтроки;
	Если Заказы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Выделите заказы, по которым оформить реализацию';
				|fr = 'Sélectionnez les commandes pour créer la vente';
				|en = 'Select the orders to create the sale for';
				|es = 'Seleccione los pedidos para crear la venta'"));
		Возврат;
	КонецЕсли;

	Если Заказы.Количество() = 1 Тогда
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",
			Новый Структура("Основание", Заказы[0]));
		Возврат;
	КонецЕсли;

	Создано = СоздатьРеализацииНаСервере(Заказы);
	Элементы.Список.Обновить();
	Заголовок = НСтр("ru = 'Создание реализаций'; fr = 'Création des ventes';
		|en = 'Creating sales'; es = 'Creación de ventas'");
	ШаблонТекста = НСтр("ru = 'Создано документов: %1 (записаны без проведения)';
		|fr = 'Documents créés : %1 (enregistrés sans validation)';
		|en = 'Documents created: %1 (saved without posting)';
		|es = 'Documentos creados: %1 (guardados sin validar)'");
	Текст = СтрШаблон(ШаблонТекста, Создано);
	ПоказатьОповещениеПользователя(Заголовок, , Текст);

КонецПроцедуры

#КонецОбласти

#Область Служебные

// Отбирает список по виду хозяйственной операции: 0 - все, 1 - продажи клиенту,
// 2 - накладные по отгрузкам. Отбор ставится программно, чтобы тумблер над списком
// и настройки списка не спорили за один и тот же элемент отбора.
//
&НаСервере
Процедура ПрименитьФильтрОперации()

	Поле = Новый ПолеКомпоновкиДанных("ХозяйственнаяОперация");

	Элемент = Неопределено;
	Для Каждого Существующий Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Существующий) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Существующий.ЛевоеЗначение = Поле Тогда
			Элемент = Существующий;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ФильтрОперации = 0 Тогда
		Если Элемент <> Неопределено Тогда
			Список.Отбор.Элементы.Удалить(Элемент);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Элемент = Неопределено Тогда
		Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Поле;
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;

	Операции = Перечисления.ХозяйственныеОперации;
	Элемент.ПравоеЗначение = ?(ФильтрОперации = 1, Операции.РеализацияКлиенту,
		Операции.НакладнаяПоОтгрузкамТовара);
	Элемент.Использование = Истина;

КонецПроцедуры

// Ставит либо снимает отборы динамического списка по полям правой панели.
// Отборы программные: пользовательские настройки списка их не перетирают.
//
&НаСервере
Процедура ПрименитьОтборы()

	Отборы = Новый Структура;
	Отборы.Вставить("Контрагент", ОтборКонтрагент);
	Отборы.Вставить("Организация", ОтборОрганизация);
	Отборы.Вставить("МестоХранения", ОтборСклад);
	Отборы.Вставить("Ответственный", ОтборОтветственный);

	Для Каждого Отбор Из Отборы Цикл
		УстановитьОтборПоПолю(Отбор.Ключ, Отбор.Значение);
	КонецЦикла;

КонецПроцедуры

// Один программный элемент отбора списка: значение пусто - элемент снимается.
//
// Параметры:
//  Поле     - Строка       - имя поля динамического списка
//  Значение - Произвольный - отбираемое значение
//
&НаСервере
Процедура УстановитьОтборПоПолю(Поле, Значение)

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);

	Найденный = Неопределено;
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			Найденный = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(Значение) Тогда
		Если Найденный <> Неопределено Тогда
			Список.Отбор.Элементы.Удалить(Найденный);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Найденный = Неопределено Тогда
		Найденный = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Найденный.ЛевоеЗначение = ПолеКомпоновки;
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	Найденный.ПравоеЗначение = Значение;
	Найденный.Использование = Истина;

КонецПроцедуры

// Правая панель: краткие сведения о текущей реализации и её состав.
//
// Параметры:
//  Ссылка - ДокументСсылка.РеализацияТоваровУслуг - текущая строка списка
//
&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Док.Сумма КАК Сумма,
		|	Док.Ответственный КАК Ответственный
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Контрагенты.Ссылка = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Реквизиты.Реквизит КАК Реквизит,
		|	Реквизиты.Представление КАК Представление
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК Реквизиты
		|		ПО Реквизиты.Контрагент = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.СуммаСНДС) КАК Сумма
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ТЧТовары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();

	Строки = Новый Массив;
	Шапка = Результаты[0].Выбрать();
	Если Шапка.Следующий() Тогда
		Строки.Добавить(Строка(Шапка.Контрагент));
		Если ЗначениеЗаполнено(Шапка.НаименованиеПолное) Тогда
			Строки.Добавить(Шапка.НаименованиеПолное);
		КонецЕсли;
		Строки.Добавить("");
		Контакты = Результаты[1].Выбрать();
		Пока Контакты.Следующий() Цикл
			Строки.Добавить(Строка(Контакты.Реквизит) + ": " + Контакты.Представление);
		КонецЦикла;
		Строки.Добавить("");
		ШаблонСуммы = НСтр("ru = 'Сумма: %1'; fr = 'Montant : %1';
			|en = 'Amount: %1'; es = 'Importe: %1'");
		СтрокаСуммы = СтрШаблон(ШаблонСуммы, Формат(Шапка.Сумма, "ЧДЦ=2; ЧРГ=' '"));
		Строки.Добавить(СтрокаСуммы);
		ШаблонОтветственного = НСтр("ru = 'Ответственный: %1'; fr = 'Responsable : %1';
			|en = 'Responsible: %1'; es = 'Responsable: %1'");
		СтрокаОтветственного = СтрШаблон(ШаблонОтветственного, Строка(Шапка.Ответственный));
		Строки.Добавить(СтрокаОтветственного);
	КонецЕсли;
	ИнфоТекст = СтрСоединить(Строки, Символы.ПС);

	ТаблицаСостав.Очистить();
	Состав = Результаты[2].Выбрать();
	Пока Состав.Следующий() Цикл
		Строка = ТаблицаСостав.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Состав);
	КонецЦикла;

КонецПроцедуры

// Создаёт и записывает реализации по заказам. Проведение остаётся за пользователем:
// автоматическое проведение пачки скрыло бы ошибки остатков.
//
// Параметры:
//  Заказы - Массив из ДокументСсылка.ЗаказПокупателя - выделенные заказы
//
// Возвращаемое значение:
//  Число - сколько документов создано
//
&НаСервере
Функция СоздатьРеализацииНаСервере(Знач Заказы)

	Создано = 0;
	Для Каждого Заказ Из Заказы Цикл
		Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Продолжить;
		КонецЕсли;
		Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Док.Дата = ТекущаяДатаСеанса();
		Док.Заполнить(Заказ);
		Док.Записать();
		Создано = Создано + 1;
	КонецЦикла;

	Возврат Создано;

КонецФункции

#КонецОбласти
